"""Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так
і маленькі). Цикл не повинен завершитися, якщо користувач ввів слово без букви "h"."""


def word_h():
    while True:
        word = input("Введи слово, в якому є літера 'h': ")
        if (
            "h" in word.lower() or "H" in word.upper()
        ):  # перевіряємо в нижньому регістрі
            print("Слово містить літеру 'h'.")
            break
        else:
            print("У цьому слові немає літери 'h'. Спробуй ще раз.")


word_h()
